Hi @jbardin ,

our problem is that even if there is no change in code terraform is showing change in zip file hash.

Steps to reproduce 
1. yarn build (this builds my application zip file )
2. terraform plan 
3. terraform apply
```
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "********"
      ~ last_modified                  = "2022-03-22T06:19:00.722+0000" -> (known after apply)
      ~ qualified_arn                  = "**********" -> (known after apply)
      ~ source_code_hash               = "6e5I+6+8q5MP5807W51FOztLLcMtIAdeB+pAMefDkgk=" -> "e9ee48fbafbcab930fe7cd3b5b9d453b3b4b2dc32d20075e07ea4031e7c39209"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (16 unchanged attributes hidden)
        # (2 unchanged blocks hidden)
    }
```
4. terraform apply (This still shows changes in zip file hash)
```
  # module.submissions_lambda.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "*********"
      ~ last_modified                  = "2022-03-22T07:21:56.000+0000" -> (known after apply)
      ~ qualified_arn                  = "**************" -> (known after apply)
      ~ source_code_hash               = "6e5I+6+8q5MP5807W51FOztLLcMtIAdeB+pAMefDkgk=" -> "e9ee48fbafbcab930fe7cd3b5b9d453b3b4b2dc32d20075e07ea4031e7c39209"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (16 unchanged attributes hidden)
        # (2 unchanged blocks hidden)
    }
```

